---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarContainerItem.BarsOnNormalSide
source: html/9ad847b0-7284-8d68-d56a-46b916445b2e.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.BarsOnNormalSide Property

Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal.

## Syntax (C#)
```csharp
public bool BarsOnNormalSide { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - This rebar element represents a single bar (the layout rule is Single).